{"pageContext":{"posts":[{"excerpt":"En el celular puedes pasar increíbles cantidades de tiempo diario. \"Navegnado\", o \"en el Internet\", es la actividad principal que secuestra nuestro tiempo libre.  Leemos incontables tweets; publicaciones de facebook van y vienen; decenas de fotos y…","html":"<p>En el celular puedes pasar increíbles cantidades de tiempo diario. \"Navegnado\", o \"en el Internet\", es la actividad principal que secuestra nuestro tiempo libre.  Leemos incontables tweets; publicaciones de facebook van y vienen; decenas de fotos y videos deleitan nuestros ojos en Instagram y llegamos, como si fueran callejones, a uno que otro video o artículo fuera de estas redes sociales.</p>\n<p>Horas, querida audiencia, son las que mi aparato registra diario arrebatadas, o mejor dicho cedidas, de mi vida. Si tienes un iPhone no me dejaras mentir pues basta ver tiempo en pantalla para ver el aterrador resumen de cuánto y a qué apps les regalas tu corta existencia. (Si tienes android puedes bajar una app o hay marcas que te lo dan).</p>\n<p>Todo esto lo plasmo de contexto para presentar el verdadero problema. <em>Consumimos más ideas de las que generamos</em>. No quiere decir que esté mal per se, pero en mi opinión es el equivalente a comer más de lo que ejercitas, o más impactante aún, es gastar más de lo que ganas. Una forma de edónismo, en la que el placer intelectual es satisfecho y repleto por bits de información que proyectan luz en nuestras pantallas negras, en nuestros <em>black mirrors</em>. </p>\n<p>Algunas redes sociales como facebook o twitter nos hacen creer que somos los autores, pero cada vez más veo como somos sólo comentaristas de las publicaciones que alguien más genera. A lo mucho nuestros feeds son una selección de publicaciones que re-publicamos, son una mera selección, una curación de aquellos <em>memes</em> que nos gustan y se alinean con nuestros intereses. Instagram, es como una estanteria de dulces. Es como entrar a Miniso y ver todas las cosas maravillosas que deleitan nuestros sentidos. Claro que podemos participar pero hay una cierta presión por generar contenido estéticamente agradable que demuestre lo interesante, geniales y <em>cools</em> que somos. Que quede dicho, no hay pena en esto, ser parte de una tribu y ser reconocido socialmente es una necesidad humana básica y estás redes llenan, o al menos fingen, la satisfacción de pertenecer y reconocimiento. </p>\n<p>Pero ahora, tenemos un déficit de energía intelectual, por llamarlo de un modo. Consumimos más energía intelectual (publicaciones, videos, imágenes, memes, texto, sonido, series, películas, etc) de la que creamos. ¿Cuándo fue la última hiciste alguna de estás actividades? Crear un meme, escribir una carta, escribir una publicación de más de dos párrafos (y que no fuera polarizante), grabar un video, crear un collage, tomar fotos por el placer visual y no para documentar -presumir- el viaje, el lugar o las personas que te rodean. Si consumimos de más engordamos, cuál es el equivalente de sólo consumir contenido creativo y no ejercitarlo. Si gastas de más te pega el banco o tu tatá (figura de autoridad) con intereses o regaños y ya no puedes gastar más ¿Cuál será el efecto nocivo de no usar nuestra creatividad de una forma sana? Bueno y ya no empiezo con que hay de contenido a contenido, hay comida deliciosa y comida asquerosa y dañina -porn, cough cough-. ¿Ya empiezas a imaginar por qué vez tanta gente con tantos pedos mentales?</p>\n<p>Tengo varios amigo periodistas que viven de escribir. Mi estimado Elihas ha entrevista a Mújica y ha estado en medio de situaciones de alcance mundial, por ejemplo la caravana migrante. Escribir puede llevarnos lejos.\nYo aspiro a dejar textos que sean útiles de alguna u otra forma. Ya lo son para mi pues descargo y organizo las ideas de mi cabeza. Trabajo y me da gusto aprender</p>\n<h1 id=\"3-razones-por-las-cuales-escribir-un-blog\"><a href=\"#3-razones-por-las-cuales-escribir-un-blog\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>3 Razones por las cuales escribir un blog</h1>\n<h1 id=\"4-mitos-por-las-cuales-no-escribir-un-blog\"><a href=\"#4-mitos-por-las-cuales-no-escribir-un-blog\" aria-hidden=\"true\" class=\"anchor\"><svg aria-hidden=\"true\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>4 mitos por las cuales no escribir un blog</h1>\n<p>No tenemos\nNo soy bueno escribiendo</p>","id":"d5427147-51a8-5ca9-804f-b339c6dfbccd","fields":{"slug":"por-que-escribir-un-blog"},"frontmatter":{"date":"2019-02-20","title":"¿Por qué escribir un blog?","category":"General","tags":["blog"],"banner":null},"timeToRead":2},{"excerpt":"Gatsby es un framework para generar webapps, por ejemplo, blogs. Esta basado en React y GraphQL. Por mucho tiempo, he querido retomar un blog. Había tenido varios deseos Manter simple el blog Escribir en  Markdown Utilizar código para Llevar un…","html":"<p>Gatsby es un framework para generar webapps, por ejemplo, blogs. Esta basado en React y GraphQL.</p>\n<p>Por mucho tiempo, he querido retomar un blog. Había tenido varios deseos</p>\n<ul>\n<li>Manter simple el blog</li>\n<li>Escribir en <em>Markdown</em></li>\n<li>\n<p>Utilizar código para</p>\n<ul>\n<li>Llevar un control de versiones </li>\n<li>Poder modificar layout a discrecionalidad</li>\n<li>Insertar cualquier funcionalidad web (tener control)</li>\n</ul>\n</li>\n</ul>\n<p>Por mucho tiempo he buscado la forma de tener esto. Ya detecte varios frameworks que permiten hacer un  <em>Static Site Generators</em> o SSG. Incluso, probé uno llamado <a href=\"gohugo.io\" title=\"Hugo\">Hugo</a>. Tengo que reconocer que el nombre me sesgo. </p>\n<p>Lo padre de Gatsby es que esta basado en React (y se le puede añadir de Typescript) que es una tecnología que ya tengo familiaridad. Y GraphQl es una en la que estoy muy interesado por aprender.</p>\n<p>La popularidad de Gatsby también va en aumento y ya hay <em>devstars</em> por ahí usandolo. Uno que recomiendo mucho es el blog de <a href=\"https://overreacted.io/\" title=\"Overreacted\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Dan Abramov</a> que trabaja en el equipo de ReactJs.</p>\n<p>Además con este tema de Gatsby ya vienen todos estos <em>features</em>:</p>\n<ul>\n<li>Mobile-First approach in development.</li>\n<li>TSLint &#x26; Prettier</li>\n<li>Offline support</li>\n<li>Category and Tag for post</li>\n<li>Type Safe by TypeScript</li>\n<li>Format Safe by TSLint, StyleLint and Prettier with Lint-Staged(Husky)</li>\n<li>Blog page</li>\n<li>Syntax highlighting in code blocks.</li>\n<li>Pagination Ready</li>\n<li>Ready to deploy to Github pages</li>\n<li>Automatic RSS generation.</li>\n<li>Automatic Sitemap generation.</li>\n<li>Automatic support for Google Tag Manager</li>\n</ul>","id":"0e9b2855-6b3c-5fcc-b8f6-781c44453c5c","fields":{"slug":"gatsby-para-blog-personal"},"frontmatter":{"date":"2019-01-11","title":"Gatsby para blog personal","category":"General","tags":["blog"],"banner":null},"timeToRead":1}],"tagName":"blog"}}